### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
df = pd.read_csv(file_to_load)

In [2]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Purchase ID  780 non-null    int64
 1   SN           780 non-null    object
 2   Age          780 non-null    int64
 3   Gender       780 non-null    object
 4   Item ID      780 non-null    int64
 5   Item Name    780 non-null    object
 6   Price        780 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 42.8+ KB

In [4]:
df.shape

(780, 7)

## Player Count

* Display the total number of players

In [5]:
# unique screennames, SN, should provide a player count for this data set
total_players = df['SN'].nunique()
players_df = pd.DataFrame()
players_df['Total Players']= [total_players]
players_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [6]:
unique_items = df['Item ID'].nunique()
ave_price = round(df['Price'].mean(),2)
total_purchases = len(df)
total_rev = df['Price'].sum()

summary_df = pd.DataFrame({"Number of Unique Items": [unique_items],
                           "Average Price" : [ave_price],
                           "Number of Purchases" : [total_purchases],
                           "Total Revenue": [total_rev]})
summary_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179           3.05                  780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [8]:
# https://stackoverflow.com/questions/10373660/converting-a-pandas-groupby-output-from-series-to-dataframe
# help with turning groupby into a dataframe
people_df = df.groupby(['SN','Gender']).count().reset_index()
people_df

                SN  Gender  Purchase ID  Age  Item ID  Item Name  Price
0     Adairialis76    Male            1    1        1          1      1
1      Adastirin33  Female            1    1        1          1      1
2           Aeda94    Male            1    1        1          1      1
3           Aela59    Male            1    1        1          1      1
4        Aelaria33    Male            1    1        1          1      1
..             ...     ...          ...  ...      ...        ...    ...
571     Yathecal82  Female            3    3        3          3      3
572     Yathedeu43    Male            2    2        2          2      2
573  Yoishirrala98  Female            1    1        1          1      1
574     Zhisrisu83    Male            2    2        2          2      2
575      Zontibe81    Male            3    3        3          3      3

[576 rows x 7 columns]

In [9]:
people_df.groupby('Gender').count()

                        SN  Purchase ID  Age  Item ID  Item Name  Price
Gender
Female                  81           81   81       81         81     81
Male                   484          484  484      484        484    484
Other / Non-Disclosed   11           11   11       11         11     11

In [10]:
# https://stackoverflow.com/questions/47136436/python-pandas-convert-value-counts-output-to-dataframe
# help turning value_counts() into a DataFrame

gender_df = people_df.Gender.value_counts().rename_axis('Gender').sort_index(ascending=True).reset_index(name='Counts')
gender_df

                  Gender  Counts
0                 Female      81
1                   Male     484
2  Other / Non-Disclosed      11

In [11]:
gender_df['Percentage of Players'] = round(gender_df.Counts / len(people_df),2)
gender_df

                  Gender  Counts  Percentage of Players
0                 Female      81                   0.14
1                   Male     484                   0.84
2  Other / Non-Disclosed      11                   0.02


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [12]:
df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [13]:
purchase_count = df.groupby('Gender')['Purchase ID'].count()
purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [14]:
ave_purchase = round(df.groupby('Gender')['Price'].mean(),2)
ave_purchase

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [15]:
total_purch_value = round(df.groupby('Gender')['Price'].sum(),2)
total_purch_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [16]:
ave_purch_price = round(df.groupby('Gender')['Price'].sum() / people_df.groupby('Gender')['SN'].count(),2)
ave_purch_price

Gender
Female                   4.47
Male                     4.07
Other / Non-Disclosed    4.56
dtype: float64

In [17]:
gender_purch_df = pd.DataFrame()

gender_purch_df['Purchase Count'] = purchase_count
gender_purch_df['Average Purchase Price'] = ave_purchase
gender_purch_df['Total Purchase Value'] = total_purch_value
gender_purch_df['Avg Total Purchase per Person'] = ave_purch_price
gender_purch_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.20,361.94,4.47
Male,652,3.02,1967.64,4.07
Other / Non-Disclosed,15,3.35,50.19,4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [18]:
df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [19]:
df.Age.value_counts().sort_index(ascending = True)

7      9
8      8
9      6
10     9
11     7
12     6
13     4
14     2
15    35
16    30
17    22
18    26
19    23
20    99
21    62
22    70
23    67
24    67
25    59
26    14
27    10
28     5
29    13
30    35
31     7
32     8
33    14
34     9
35    14
36     5
37     7
38     9
39     6
40     6
41     2
42     1
43     1
44     2
45     1
Name: Age, dtype: int64

In [20]:
# Create bins in which to place values based upon TED Talk views
bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]

# Create labels for these bins
group_labels = ["Under 10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40 and Over"]

In [21]:
# Slice the data and place it into bins

pd.cut(df["Age"], bins, labels=group_labels).head()

0          20-24
1    40 and Over
2          20-24
3          20-24
4          20-24
Name: Age, dtype: category
Categories (8, object): [Under 10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40 and Over]

In [22]:
df["Age Group"] = pd.cut(df["Age"], bins, labels=group_labels)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40 and Over
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [37]:
age_df = df.groupby(['SN','Age Group']).count().reset_index().rename(columns={0:'Counts'}).dropna()
age_summary_df = age_df.groupby('Age Group').size().reset_index().rename(columns={0:'Counts'})
age_summary_df["Percentage of Players"] = round( age_summary_df["Counts"]/ len(age_df)*100,2)
age_summary_df

     Age Group  Counts  Percentage of Players
0     Under 10      17                   2.95
1        10-14      22                   3.82
2        15-19     107                  18.58
3        20-24     258                  44.79
4        25-29      77                  13.37
5        30-34      52                   9.03
6        35-39      31                   5.38
7  40 and Over      12                   2.08

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [42]:
age_purchase_count = df.groupby("Age Group").size()
age_purchase_ave = df.groupby("Age Group").Price.mean()
age_purchase_sum = df.groupby("Age Group").Price.sum()
age_purchase_per_person = round(df.groupby("Age Group").Price.sum() / age_df.groupby('Age Group').size(),2)

age_purchasing_df = pd.DataFrame()

age_purchasing_df["Number of Purchases"] = age_purchase_count
age_purchasing_df["Average Purchase Amount"] = age_purchase_ave
age_purchasing_df["Total Purchase Amount"] = age_purchase_sum
age_purchasing_df["Average Purchase per Person"] = age_purchase_per_person
age_purchasing_df

,Number of Purchases,Average Purchase Amount,Total Purchase Amount,Average Purchase per Person
Age Group,,,,
Under 10,23,3.353478,77.13,4.54
10-14,28,2.956429,82.78,3.76
15-19,136,3.035956,412.89,3.86
20-24,365,3.052219,1114.06,4.32
25-29,101,2.900990,293.00,3.81
30-34,73,2.931507,214.00,4.12
35-39,41,3.601707,147.67,4.76
40 and Over,13,2.941538,38.24,3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [50]:
spender_purch_count = df.groupby('SN').Price.count()
spender_purch_avg = df.groupby('SN').Price.sum() / df.groupby('SN').Price.count()
spender_purch_total = df.groupby('SN').Price.sum()

spenders_df = pd.DataFrame()
spenders_df['Purchase Count'] = spender_purch_count
spenders_df['Average Purchase Price'] = spender_purch_avg
spenders_df['Total Purchase Value'] = spender_purch_total
spenders_df.sort_values(by=['Total Purchase Value'], ascending=False).head(5)

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [51]:
df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price',
       'Age Group'],
      dtype='object')

In [59]:
items_df = df[['Item ID','Item Name','Price']]
items_purch_count = items_df.groupby(['Item ID','Item Name'])['Price'].count()
items_price = items_df.groupby(['Item ID','Item Name'])['Price'].sum() / items_df.groupby(['Item ID','Item Name'])['Price'].count()
items_total_val = items_df.groupby(['Item ID','Item Name'])['Price'].sum()

items_summary_df = pd.DataFrame()
items_summary_df['Purchase Count'] = items_purch_count
items_summary_df['Item Price'] = items_price
items_summary_df['Total Purchase Value'] = items_total_val
items_summary_df.sort_values(by='Purchase Count', ascending = False).head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [60]:
items_summary_df.sort_values(by='Total Purchase Value', ascending = False).head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80